<a href="https://colab.research.google.com/github/Mohit1-K/Customer-ad-click-prediction/blob/main/Customer_ad_click_prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
import pandas as pd
import numpy as np

In [4]:
Df= pd.read_csv("/content/drive/MyDrive/Notebook work/advertising.csv")

In [90]:
Df

     Daily Time Spent on Site  Age  ...            Timestamp  Clicked on Ad
0                       68.95   35  ...  2016-03-27 00:53:11              0
1                       80.23   31  ...  2016-04-04 01:39:02              0
2                       69.47   26  ...  2016-03-13 20:35:42              0
3                       74.15   29  ...  2016-01-10 02:31:19              0
4                       68.37   35  ...  2016-06-03 03:36:18              0
..                        ...  ...  ...                  ...            ...
995                     72.97   30  ...  2016-02-11 21:49:00              1
996                     51.30   45  ...  2016-04-22 02:07:01              1
997                     51.63   51  ...  2016-02-01 17:24:57              1
998                     55.55   19  ...  2016-03-24 02:35:54              0
999                     45.01   26  ...  2016-06-03 21:43:21              1

[1000 rows x 10 columns]

In [91]:
Df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Ad Topic Line             1000 non-null   object
 5   City                      1000 non-null   object
 6   Male                      1000 non-null   int64
 7   Country                   1000 non-null   object
 8   Timestamp                 1000 non-null   object
 9   Clicked on Ad             1000 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 78.2+ KB

In [92]:
print(len(Df["Country"].unique()))

237

In [93]:
data= Df.drop(columns= ["Country" , "City", "Ad Topic Line"]).copy()

In [94]:
data.head()

   Daily Time Spent on Site  Age  ...            Timestamp  Clicked on Ad
0                     68.95   35  ...  2016-03-27 00:53:11              0
1                     80.23   31  ...  2016-04-04 01:39:02              0
2                     69.47   26  ...  2016-03-13 20:35:42              0
3                     74.15   29  ...  2016-01-10 02:31:19              0
4                     68.37   35  ...  2016-06-03 03:36:18              0

[5 rows x 7 columns]

In [95]:
data["Timestamp"]= pd.to_datetime(data["Timestamp"])

In [96]:
data.head()

   Daily Time Spent on Site  Age  ...           Timestamp  Clicked on Ad
0                     68.95   35  ... 2016-03-27 00:53:11              0
1                     80.23   31  ... 2016-04-04 01:39:02              0
2                     69.47   26  ... 2016-03-13 20:35:42              0
3                     74.15   29  ... 2016-01-10 02:31:19              0
4                     68.37   35  ... 2016-06-03 03:36:18              0

[5 rows x 7 columns]

In [97]:
data["Hour"]= data["Timestamp"].dt.hour

In [98]:
data.head()

   Daily Time Spent on Site  Age  ...  Clicked on Ad  Hour
0                     68.95   35  ...              0     0
1                     80.23   31  ...              0     1
2                     69.47   26  ...              0    20
3                     74.15   29  ...              0     2
4                     68.37   35  ...              0     3

[5 rows x 8 columns]

In [99]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Male                      1000 non-null   int64
 5   Timestamp                 1000 non-null   datetime64[ns]
 6   Clicked on Ad             1000 non-null   int64
 7   Hour                      1000 non-null   int64
dtypes: datetime64[ns](1), float64(3), int64(4)
memory usage: 62.6 KB

In [108]:
X= data.drop("Clicked on Ad", axis=1)

In [106]:
y= data["Clicked on Ad"]

In [109]:
X.head()

   Daily Time Spent on Site  Age  Area Income  ...  Male           Timestamp Hour
0                     68.95   35     61833.90  ...     0 2016-03-27 00:53:11    0
1                     80.23   31     68441.85  ...     1 2016-04-04 01:39:02    1
2                     69.47   26     59785.94  ...     0 2016-03-13 20:35:42   20
3                     74.15   29     54806.18  ...     1 2016-01-10 02:31:19    2
4                     68.37   35     73889.99  ...     0 2016-06-03 03:36:18    3

[5 rows x 7 columns]

In [107]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Clicked on Ad, dtype: int64

In [111]:
X['Timestamp']=X['Timestamp'].map(dt.datetime.toordinal)

In [112]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Male                      1000 non-null   int64
 5   Timestamp                 1000 non-null   int64
 6   Hour                      1000 non-null   int64
dtypes: float64(3), int64(4)
memory usage: 54.8 KB

In [113]:
from sklearn.model_selection import train_test_split